; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-83)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b10)
    (on b10 b6)
    (on b6 b21)
    (on b21 b7)
    (on b7 b4)
    (on b4 b5)
    (on b5 b17)
    (on b17 b23)
    (on b23 b19)
    (on b19 b25)
    (on b25 b24)
    (on b24 b2)
    (on b2 b1)
    (on b1 b12)
    (on b12 b11)
    (on b11 b22)
    (on b22 b3)
    (on b3 b18)
    (on b18 b9)
    (on b9 b16)
    (on b16 b14)
    (on b14 b8)
    (on b8 b20)
    (on b20 b13)
    (on-table b13))
 (:goal (and 
(on b24 b15)
))
)

; plan
1. (unstack b15 b10)
   deleted: (on b15 b10) (clear b15) (arm-empty)
   added: (holding b15) (clear b10)
   goals met: 0 of 1
2. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
3. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 0 of 1
4. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
5. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 0 of 1
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
7. (unstack b21 b7)
   deleted: (on b21 b7) (clear b21) (arm-empty)
   added: (holding b21) (clear b7)
   goals met: 0 of 1
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
9. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 0 of 1
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
11. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 0 of 1
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
13. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 0 of 1
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
15. (unstack b17 b23)
   deleted: (on b17 b23) (clear b17) (arm-empty)
   added: (holding b17) (clear b23)
   goals met: 0 of 1
16. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
17. (unstack b23 b19)
   deleted: (on b23 b19) (clear b23) (arm-empty)
   added: (holding b23) (clear b19)
   goals met: 0 of 1
18. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
19. (unstack b19 b25)
   deleted: (on b19 b25) (clear b19) (arm-empty)
   added: (holding b19) (clear b25)
   goals met: 0 of 1
20. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
21. (unstack b25 b24)
   deleted: (on b25 b24) (clear b25) (arm-empty)
   added: (holding b25) (clear b24)
   goals met: 0 of 1
22. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 1
23. (unstack b24 b2)
   deleted: (on b24 b2) (clear b24) (arm-empty)
   added: (holding b24) (clear b2)
   goals met: 0 of 1
24. (stack b24 b15)
   deleted: (clear b15) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b15)
   goals met: 1 of 1
